In [1]:
from pyspark.sql import SparkSession
spark = SparkSession.builder.appName("practice").getOrCreate()

22/01/18 20:59:00 WARN Utils: Your hostname, sunghwanui-MacBookPro.local resolves to a loopback address: 127.0.0.1; using 192.168.1.8 instead (on interface en0)
22/01/18 20:59:00 WARN Utils: Set SPARK_LOCAL_IP if you need to bind to another address
22/01/18 20:59:00 WARN NativeCodeLoader: Unable to load native-hadoop library for your platform... using builtin-java classes where applicable
Using Spark's default log4j profile: org/apache/spark/log4j-defaults.properties
Setting default log level to "WARN".
To adjust logging level use sc.setLogLevel(newLevel). For SparkR, use setLogLevel(newLevel).
22/01/18 20:59:01 WARN Utils: Service 'SparkUI' could not bind on port 4040. Attempting port 4041.

In [4]:
df = spark.read.csv("test2.csv", header=True, inferSchema=True)

In [5]:
df.printSchema()

root
 |-- Name: string (nullable = true)
 |-- age: integer (nullable = true)
 |-- experience: integer (nullable = true)
 |-- Salary: integer (nullable = true)

In [7]:
df.describe().show()

+-------+-----+------------------+------------------+------------------+
|summary| Name|               age|        experience|            Salary|
+-------+-----+------------------+------------------+------------------+
|  count|    5|                 7|                 5|                 7|
|   mean| null|43.142857142857146|               6.4|59057.142857142855|
| stddev| null| 21.17725644355733|2.3021728866442674|65188.620099494285|
|    min|danny|                23|                 4|              3400|
|    max|  kim|                87|                10|            200000|
+-------+-----+------------------+------------------+------------------+

In [15]:
df = df.withColumn("age 2", df['age']+2)

In [16]:
df = df.withColumnRenamed("age 2", "age plus 2")

In [17]:
df.show()

+-------+----+----------+------+----------+
|   Name| age|experience|Salary|age plus 2|
+-------+----+----------+------+----------+
|  danny|  30|        10| 30000|        32|
|hyunjoo|  33|      null| 40000|        35|
| eileen|  23|         5| 70000|        25|
| hailey|  44|         4|  3400|        46|
|   null|null|      null| 40000|      null|
|    kim|  36|         6|200000|        38|
|   null|  87|         7| 30000|        89|
|   null|  49|      null|  null|        51|
+-------+----+----------+------+----------+

In [30]:
df.dtypes

[('Name', 'string'), ('age', 'int'), ('experience', 'int'), ('Salary', 'int')]

In [21]:
df.select(["age","Salary"]).show()

+----+------+
| age|Salary|
+----+------+
|  30| 30000|
|  33| 40000|
|  23| 70000|
|  44|  3400|
|null| 40000|
|  36|200000|
|  87| 30000|
|  49|  null|
+----+------+

In [25]:
df = df.drop("age plus 2")

In [26]:
df.show()

+-------+----+----------+------+
|   Name| age|experience|Salary|
+-------+----+----------+------+
|  danny|  30|        10| 30000|
|hyunjoo|  33|      null| 40000|
| eileen|  23|         5| 70000|
| hailey|  44|         4|  3400|
|   null|null|      null| 40000|
|    kim|  36|         6|200000|
|   null|  87|         7| 30000|
|   null|  49|      null|  null|
+-------+----+----------+------+

In [31]:
df.head(5)

[Row(Name='danny', age=30, experience=10, Salary=30000),
 Row(Name='hyunjoo', age=33, experience=None, Salary=40000),
 Row(Name='eileen', age=23, experience=5, Salary=70000),
 Row(Name='hailey', age=44, experience=4, Salary=3400),
 Row(Name=None, age=None, experience=None, Salary=40000)]

In [33]:
for i in df.head(5):
    print(i["Name"])

danny
hyunjoo
eileen
hailey
None

In [35]:
df.show()

+-------+----+----------+------+
|   Name| age|experience|Salary|
+-------+----+----------+------+
|  danny|  30|        10| 30000|
|hyunjoo|  33|      null| 40000|
| eileen|  23|         5| 70000|
| hailey|  44|         4|  3400|
|   null|null|      null| 40000|
|    kim|  36|         6|200000|
|   null|  87|         7| 30000|
|   null|  49|      null|  null|
+-------+----+----------+------+

In [36]:
df.drop("Name").show()

+----+----------+------+
| age|experience|Salary|
+----+----------+------+
|  30|        10| 30000|
|  33|      null| 40000|
|  23|         5| 70000|
|  44|         4|  3400|
|null|      null| 40000|
|  36|         6|200000|
|  87|         7| 30000|
|  49|      null|  null|
+----+----------+------+

In [37]:
df.show()

+-------+----+----------+------+
|   Name| age|experience|Salary|
+-------+----+----------+------+
|  danny|  30|        10| 30000|
|hyunjoo|  33|      null| 40000|
| eileen|  23|         5| 70000|
| hailey|  44|         4|  3400|
|   null|null|      null| 40000|
|    kim|  36|         6|200000|
|   null|  87|         7| 30000|
|   null|  49|      null|  null|
+-------+----+----------+------+

In [38]:
df.na.drop().show()

+------+---+----------+------+
|  Name|age|experience|Salary|
+------+---+----------+------+
| danny| 30|        10| 30000|
|eileen| 23|         5| 70000|
|hailey| 44|         4|  3400|
|   kim| 36|         6|200000|
+------+---+----------+------+

In [40]:
df.na.drop(how="any").show()

+------+---+----------+------+
|  Name|age|experience|Salary|
+------+---+----------+------+
| danny| 30|        10| 30000|
|eileen| 23|         5| 70000|
|hailey| 44|         4|  3400|
|   kim| 36|         6|200000|
+------+---+----------+------+

In [41]:
df.na.drop(how="all").show()

+-------+----+----------+------+
|   Name| age|experience|Salary|
+-------+----+----------+------+
|  danny|  30|        10| 30000|
|hyunjoo|  33|      null| 40000|
| eileen|  23|         5| 70000|
| hailey|  44|         4|  3400|
|   null|null|      null| 40000|
|    kim|  36|         6|200000|
|   null|  87|         7| 30000|
|   null|  49|      null|  null|
+-------+----+----------+------+

In [42]:
df.dtypes

[('Name', 'string'), ('age', 'int'), ('experience', 'int'), ('Salary', 'int')]

In [43]:
df.columns

['Name', 'age', 'experience', 'Salary']

In [48]:
df.na.drop(how="any", thresh=1).show()

+-------+----+----------+------+
|   Name| age|experience|Salary|
+-------+----+----------+------+
|  danny|  30|        10| 30000|
|hyunjoo|  33|      null| 40000|
| eileen|  23|         5| 70000|
| hailey|  44|         4|  3400|
|   null|null|      null| 40000|
|    kim|  36|         6|200000|
|   null|  87|         7| 30000|
|   null|  49|      null|  null|
+-------+----+----------+------+

In [47]:
df.show()

+-------+----+----------+------+
|   Name| age|experience|Salary|
+-------+----+----------+------+
|  danny|  30|        10| 30000|
|hyunjoo|  33|      null| 40000|
| eileen|  23|         5| 70000|
| hailey|  44|         4|  3400|
|   null|null|      null| 40000|
|    kim|  36|         6|200000|
|   null|  87|         7| 30000|
|   null|  49|      null|  null|
+-------+----+----------+------+

In [49]:
df.na.drop(how="any",  subset=["experience"]).show()

+------+---+----------+------+
|  Name|age|experience|Salary|
+------+---+----------+------+
| danny| 30|        10| 30000|
|eileen| 23|         5| 70000|
|hailey| 44|         4|  3400|
|   kim| 36|         6|200000|
|  null| 87|         7| 30000|
+------+---+----------+------+

In [55]:
df.na.fill("missing value").show()

+-------------+----+----------+------+
|         Name| age|experience|Salary|
+-------------+----+----------+------+
|        danny|  30|        10| 30000|
|      hyunjoo|  33|      null| 40000|
|       eileen|  23|         5| 70000|
|       hailey|  44|         4|  3400|
|missing value|null|      null| 40000|
|          kim|  36|         6|200000|
|missing value|  87|         7| 30000|
|missing value|  49|      null|  null|
+-------------+----+----------+------+

In [56]:
df.na.fill("missing",["name"]).show()

+-------+----+----------+------+
|   Name| age|experience|Salary|
+-------+----+----------+------+
|  danny|  30|        10| 30000|
|hyunjoo|  33|      null| 40000|
| eileen|  23|         5| 70000|
| hailey|  44|         4|  3400|
|missing|null|      null| 40000|
|    kim|  36|         6|200000|
|missing|  87|         7| 30000|
|missing|  49|      null|  null|
+-------+----+----------+------+

In [57]:
df.show()

+-------+----+----------+------+
|   Name| age|experience|Salary|
+-------+----+----------+------+
|  danny|  30|        10| 30000|
|hyunjoo|  33|      null| 40000|
| eileen|  23|         5| 70000|
| hailey|  44|         4|  3400|
|   null|null|      null| 40000|
|    kim|  36|         6|200000|
|   null|  87|         7| 30000|
|   null|  49|      null|  null|
+-------+----+----------+------+

In [58]:
df

DataFrame[Name: string, age: int, experience: int, Salary: int]

In [59]:
df.show()

+-------+----+----------+------+
|   Name| age|experience|Salary|
+-------+----+----------+------+
|  danny|  30|        10| 30000|
|hyunjoo|  33|      null| 40000|
| eileen|  23|         5| 70000|
| hailey|  44|         4|  3400|
|   null|null|      null| 40000|
|    kim|  36|         6|200000|
|   null|  87|         7| 30000|
|   null|  49|      null|  null|
+-------+----+----------+------+

In [60]:
from pyspark.ml.feature import Imputer

In [61]:
imputer = Imputer(
inputCols = ["age", "experience", "Salary"],
outputCols = ["{}_imputed".format(c) for c in ['age', 'experience', 'salary']]).setStrategy("mean")

In [62]:
imputer.fit(df).transform(df).show()

+-------+----+----------+------+-----------+------------------+--------------+
|   Name| age|experience|Salary|age_imputed|experience_imputed|salary_imputed|
+-------+----+----------+------+-----------+------------------+--------------+
|  danny|  30|        10| 30000|         30|                10|         30000|
|hyunjoo|  33|      null| 40000|         33|                 6|         40000|
| eileen|  23|         5| 70000|         23|                 5|         70000|
| hailey|  44|         4|  3400|         44|                 4|          3400|
|   null|null|      null| 40000|         43|                 6|         40000|
|    kim|  36|         6|200000|         36|                 6|        200000|
|   null|  87|         7| 30000|         87|                 7|         30000|
|   null|  49|      null|  null|         49|                 6|         59057|
+-------+----+----------+------+-----------+------------------+--------------+

In [63]:
from pyspark.ml.feature import Imputer

In [70]:
imputer = Imputer(
inputCols = ["age", "experience", "Salary"],
outputCols = ["{}_imputed".format(c) for c in ['age', 'experience', 'salary']]).setStrategy("median") #median

In [71]:
imputer.fit(df).transform(df).show()

+-------+----+----------+------+-----------+------------------+--------------+
|   Name| age|experience|Salary|age_imputed|experience_imputed|salary_imputed|
+-------+----+----------+------+-----------+------------------+--------------+
|  danny|  30|        10| 30000|         30|                10|         30000|
|hyunjoo|  33|      null| 40000|         33|                 6|         40000|
| eileen|  23|         5| 70000|         23|                 5|         70000|
| hailey|  44|         4|  3400|         44|                 4|          3400|
|   null|null|      null| 40000|         36|                 6|         40000|
|    kim|  36|         6|200000|         36|                 6|        200000|
|   null|  87|         7| 30000|         87|                 7|         30000|
|   null|  49|      null|  null|         49|                 6|         40000|
+-------+----+----------+------+-----------+------------------+--------------+